Public Attributes | List of all members
API_LibPartDoorWindowDetails Struct Reference
Library Part Management
Library part's details of window and door. Used in API_LibPartDetails. More...
#include <APIdefs_LibraryParts.h>
 Public Attributes
char  | mirThickExpr [512]
Window/door draw mirror thickness expression.
char  | wallInsetExpr [512]
Window/door parapet wall inset expression.
char  | leftFramExpr [512]
Window/door left frame expression.
char  | righFramExpr [512]
Window/door right frame expression.
char  | topFramExpr [512]
Window/door top frame expression.
char  | botFramExpr [512]
Window/door bottom frame expression.
float  | mirThick
Window/door draw mirror thickness if not expression.
float  | wallInset
Window/door parapet wall inset if not expression.
float  | leftFram
Window/door left frame if not expression.
float  | righFram
Window/door right frame if not expression.
float  | topFram
Window/door top frame if not expression.
float  | botFram
Window/door bottom frame if not expression.
char  | orientation
Defines the way the opening's orientation is displayed:
bool  | contours_3D
3D image is framed (wind/door).
bool  | uiTabDefault
Open the dialog with the User Interface tab page as the default.
bool  | uiUseHierarchicalPages
Use the new hierarchical UI page system in object settings dialog.
bool  | runVLScriptOnlyOnce
Run the parameter script of the library only once (until any change happens).
bool  | enable2DScriptDrawingOrder
Drawing order follows order of commands in 2D Script.
char  | defaultLabel [32]
Default position label.
char  | mirroredLabel [32]
Mirrored position label.
Detailed Description
Library part's details of window and door. Used in API_LibPartDetails.
Member Data Documentation
◆ botFram
 API_LibPartDoorWindowDetails::botFram
Window/door bottom frame if not expression.
◆ botFramExpr
 API_LibPartDoorWindowDetails::botFramExpr
Window/door bottom frame expression.
◆ contours_3D
 API_LibPartDoorWindowDetails::contours_3D
3D image is framed (wind/door).
◆ defaultLabel
 API_LibPartDoorWindowDetails::defaultLabel
Default position label.
◆ enable2DScriptDrawingOrder
 API_LibPartDoorWindowDetails::enable2DScriptDrawingOrder
Drawing order follows order of commands in 2D Script.
◆ leftFram
 API_LibPartDoorWindowDetails::leftFram
Window/door left frame if not expression.
◆ leftFramExpr
 API_LibPartDoorWindowDetails::leftFramExpr
Window/door left frame expression.
◆ mirroredLabel
 API_LibPartDoorWindowDetails::mirroredLabel
Mirrored position label.
◆ mirThick
 API_LibPartDoorWindowDetails::mirThick
Window/door draw mirror thickness if not expression.
◆ mirThickExpr
 API_LibPartDoorWindowDetails::mirThickExpr
Window/door draw mirror thickness expression.
◆ orientation
 API_LibPartDoorWindowDetails::orientation
Defines the way the opening's orientation is displayed:
 Value  | Meaning
 API_Orient_Default  | Display Door/Window opening orientation as a standard default setting
 API_Orient_Reverse  | Display Door/Window opening orientation in reverse as a standard default setting
 API_Orient_Custom  | Use customized display of Door/Window opening orientation
◆ righFram
 API_LibPartDoorWindowDetails::righFram
Window/door right frame if not expression.
◆ righFramExpr
 API_LibPartDoorWindowDetails::righFramExpr
Window/door right frame expression.
◆ runVLScriptOnlyOnce
 API_LibPartDoorWindowDetails::runVLScriptOnlyOnce
Run the parameter script of the library only once (until any change happens).
◆ topFram
 API_LibPartDoorWindowDetails::topFram
Window/door top frame if not expression.
◆ topFramExpr
 API_LibPartDoorWindowDetails::topFramExpr
Window/door top frame expression.
◆ uiTabDefault
 API_LibPartDoorWindowDetails::uiTabDefault
Open the dialog with the User Interface tab page as the default.
◆ uiUseHierarchicalPages
 API_LibPartDoorWindowDetails::uiUseHierarchicalPages
Use the new hierarchical UI page system in object settings dialog.
◆ wallInset
 API_LibPartDoorWindowDetails::wallInset
Window/door parapet wall inset if not expression.
◆ wallInsetExpr
 API_LibPartDoorWindowDetails::wallInsetExpr
Window/door parapet wall inset expression.